{
  "Apple___Apple_scab": "Remove infected leaves, apply fungicide (mancozeb or chlorothalonil), improve air circulation.",
  "Apple___Black_rot": "Remove mummified fruits, prune cankers, spray copper-based fungicide.",
  "Apple___Cedar_apple_rust": "Remove nearby junipers, apply myclobutanil, use resistant cultivars.",
  "Blueberry___healthy": "Plant is healthy. Maintain regular watering and apply mulch.",
  "Cherry_(including_sour)___Powdery_mildew": "Remove infected leaves, increase sunlight, spray sulfur or neem oil.",
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Rotate crops, avoid overhead watering, apply fungicide like azoxystrobin.",
  "Corn_(maize)___Common_rust_": "Use rust-resistant varieties, apply triazole fungicide if severe.",
  "Corn_(maize)___Northern_Leaf_Blight": "Use resistant hybrids, apply fungicides early.",
  "Grape___Black_rot": "Prune infected vines, remove mummified fruit, use mancozeb spray.",
  "Grape___Esca_(Black_Measles)": "Remove infected wood, avoid pruning when wet, apply trunk protectants.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Remove infected leaves, use copper fungicide, maintain vine spacing.",
  "Orange___Haunglongbing_(Citrus_greening)": "No cure. Remove infected tree, control psyllids, use certified seedlings.",
  "Peach___Bacterial_spot": "Apply copper fungicide, prune infected branches, improve drainage.",
  "Pepper,_bell___Bacterial_spot": "Use disease-free seeds, apply copper sprays, rotate crops.",
  "Potato___Early_blight": "Use resistant varieties, apply chlorothalonil or mancozeb, avoid overhead watering.",
  "Potato___Late_blight": "Destroy infected plants, apply metalaxyl fungicide, improve spacing.",
  "Raspberry___healthy": "Plant is healthy. Maintain pruning and watering schedule.",
  "Soybean___healthy": "Plant is healthy. Monitor leaf spots and pests regularly.",
  "Squash___Powdery_mildew": "Use fungicides like myclobutanil or neem oil, remove infected leaves.",
  "Strawberry___Leaf_scorch": "Remove infected leaves, improve airflow, use copper-based spray.",
  "Tomato___Bacterial_spot": "Apply copper fungicide, remove infected leaves, use resistant varieties.",
  "Tomato___Early_blight": "Prune lower leaves, apply mancozeb or chlorothalonil.",
  "Tomato___Late_blight": "Remove infected plants, apply fungicide with metalaxyl, avoid wet foliage.",
  "Tomato___Leaf_Mold": "Increase ventilation, reduce humidity, apply copper fungicide.",
  "Tomato___Septoria_leaf_spot": "Remove infected leaves, mulch soil, use fungicides.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Spray neem oil, increase humidity, use miticide if needed.",
  "Tomato___Target_Spot": "Remove affected leaves, apply azoxystrobin or chlorothalonil.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Remove infected plants, control whiteflies, use resistant varieties.",
  "Tomato___Tomato_mosaic_virus": "Remove infected plants, disinfect tools, avoid tobacco handling.",
  "unknown": "No solution available for this disease yet."
}
